# WireConduitTypeSetIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireConduitTypeSetIterator Class
Members See Also
---
An iterator to a conduit type set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class WireConduitTypeSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class WireConduitTypeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class WireConduitTypeSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..WireConduitTypeSetIterator
# See Also
WireConduitTypeSetIterator Members
Autodesk.Revit.DB.Electrical Namespace